Revit 2026 API

# ViewSheetSettingRevert Method

---

Revert the current view sheet set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Revert()
```
```vb
Public Sub Revert
```
```cpp
public:
void Revert()
```
```fsharp
member Revert : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the current view sheet set is In-Session. |

#### Reference

ViewSheetSetting Class

Autodesk.Revit.DB Namespace